package Typing.Model;

import javax.swing.JProgressBar;

public class ProgressBar {

	private static ProgressBar instance; //追加

	// =====================================
	// ProgressBar
	// =====================================

	private JProgressBar timerBar;

	// =====================================
	// 最大値(ms)
	// =====================================

	private int maxValue;

	// =====================================
	// 一時停止
	// =====================================

	private boolean paused = false;

	// =====================================
	// 更新間隔(ms)
	// =====================================

	private final int SPEED = 50;

	// =====================================
	// 時間切れ判定
	// =====================================

	private boolean timeOver = false;

	// =====================================
	// コンストラクタ
	// =====================================

	public ProgressBar(
			JProgressBar timerBar) {
		
		 instance = this;//追加

		this.timerBar = timerBar;

		
		timerBar.setValue(0);
	}
	
	public static ProgressBar getInstance() {//追加
		return instance;
	}
		// =====================================

	// =====================================
	// 更新
	// =====================================

	public void update() {

		// =====================================
		// 秒 → ms変換
		
		maxValue = Time.currentTime * 1000;
		
		// =====================================
		// ProgressBar設定
		// =====================================
		
		timerBar.setMaximum(
				maxValue);
		// =====================================
		// 一時停止中
		// =====================================

		if (paused) {

			return;
		}

		// =====================================
		// 現在値取得
		// =====================================

		int value = timerBar.getValue();

		// =====================================
		// 増加
		// =====================================

		value += SPEED;

		// =====================================
		// 反映
		// =====================================

		timerBar.setValue(value);

		// =====================================
		// 時間切れ
		// =====================================

		if (value >= maxValue) {

			timeOver = true;

			timerBar.setValue(0);
		}
	}

	// =====================================
	// 時間切れ取得
	// =====================================

	public boolean consumeTimeOver() {

		// =====================================
		// 時間切れ
		// =====================================

		if (timeOver) {

			// =====================================
			// 次回用
			// =====================================

			timeOver = false;

			return true;
		}

		return false;
	}

	// =====================================
	// 一時停止
	// =====================================

	public void pause() {

		paused = true;
	}

	// =====================================
	// 再開
	// =====================================

	public void resume() {

		paused = false;
	}

	// =====================================
	// リセット
	// =====================================

	public void reset() {

		// =====================================
		// 一時停止解除
		// =====================================

		paused = false;

		// =====================================
		// ゲージ初期化
		// =====================================

		timerBar.setValue(0);
	}
}